
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3121227674)



<pre><code>Apply complete! Resources: 9 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/492745ab-8cde-4188-9e67-35b408a801ba/terraform-bin apply -auto-approve -input=false
data.http.ghactions_oidc_config: Reading...
data.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
data.tls_certificate.ghactions: Reading...
data.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
data.aws_iam_policy_document.memo_board_tf_exec: Reading...
aws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]
aws_iam_user.memo_board: Refreshing state... [id=memo-board]
aws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]
data.aws_iam_policy_document.memo_board_tf1: Reading...
data.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]
aws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]
data.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]
aws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]
data.aws_iam_policy_document.memo_board_cd: Reading...
data.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]
aws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]
data.aws_iam_policy_document.memo_board_tf: Reading...
data.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]
aws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]
aws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]
aws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]
aws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]
data.aws_iam_policy_document.memo_board_cd1: Reading...
data.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]
aws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.memo_board will be created
  + resource "aws_internet_gateway" "memo_board" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.memo_board_1 will be created
  + resource "aws_route_table_association" "memo_board_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.memo_board_2 will be created
  + resource "aws_route_table_association" "memo_board_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.memo_board_3 will be created
  + resource "aws_route_table_association" "memo_board_3" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.memo_board_1 will be created
  + resource "aws_subnet" "memo_board_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.memo_board_2 will be created
  + resource "aws_subnet" "memo_board_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.memo_board_3 will be created
  + resource "aws_subnet" "memo_board_3" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.memo_board will be created
  + resource "aws_vpc" "memo_board" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
aws_vpc.memo_board: Creating...
aws_vpc.memo_board: Creation complete after 3s [id=vpc-07dac755b05cdc5e5]
aws_subnet.memo_board_1: Creating...
aws_internet_gateway.memo_board: Creating...
aws_subnet.memo_board_3: Creating...
aws_subnet.memo_board_2: Creating...
aws_subnet.memo_board_3: Creation complete after 1s [id=subnet-0f84ebfae4c920a30]
aws_internet_gateway.memo_board: Creation complete after 1s [id=igw-0310af73c3aeaf62f]
aws_route_table.public: Creating...
aws_subnet.memo_board_2: Creation complete after 1s [id=subnet-0ae15c749b9813fb9]
aws_subnet.memo_board_1: Creation complete after 1s [id=subnet-047a19359c4468354]
aws_route_table.public: Creation complete after 2s [id=rtb-065eee68b235bf30b]
aws_route_table_association.memo_board_2: Creating...
aws_route_table_association.memo_board_1: Creating...
aws_route_table_association.memo_board_3: Creating...
aws_route_table_association.memo_board_3: Creation complete after 0s [id=rtbassoc-013da13c782db7bbf]
aws_route_table_association.memo_board_2: Creation complete after 0s [id=rtbassoc-03236e787ed43a072]
aws_route_table_association.memo_board_1: Creation complete after 1s [id=rtbassoc-0c58c63df918ad4fc]

Apply complete! Resources: 9 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_internet_gateway.memo_board will be created%0A  + resource "aws_internet_gateway" "memo_board" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags_all = (known after apply)%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags_all         = (known after apply)%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.memo_board_1 will be created%0A  + resource "aws_route_table_association" "memo_board_1" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.memo_board_2 will be created%0A  + resource "aws_route_table_association" "memo_board_2" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.memo_board_3 will be created%0A  + resource "aws_route_table_association" "memo_board_3" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_subnet.memo_board_1 will be created%0A  + resource "aws_subnet" "memo_board_1" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.16.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.memo_board_2 will be created%0A  + resource "aws_subnet" "memo_board_2" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.16.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.memo_board_3 will be created%0A  + resource "aws_subnet" "memo_board_3" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.16.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.memo_board will be created%0A  + resource "aws_vpc" "memo_board" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "172.16.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = (known after apply)%0A      + enable_dns_support                   = true%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags_all                             = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0Aaws_vpc.memo_board: Creating...%0Aaws_vpc.memo_board: Creation complete after 3s [id=vpc-07dac755b05cdc5e5]%0Aaws_subnet.memo_board_1: Creating...%0Aaws_internet_gateway.memo_board: Creating...%0Aaws_subnet.memo_board_3: Creating...%0Aaws_subnet.memo_board_2: Creating...%0Aaws_subnet.memo_board_3: Creation complete after 1s [id=subnet-0f84ebfae4c920a30]%0Aaws_internet_gateway.memo_board: Creation complete after 1s [id=igw-0310af73c3aeaf62f]%0Aaws_route_table.public: Creating...%0Aaws_subnet.memo_board_2: Creation complete after 1s [id=subnet-0ae15c749b9813fb9]%0Aaws_subnet.memo_board_1: Creation complete after 1s [id=subnet-047a19359c4468354]%0Aaws_route_table.public: Creation complete after 2s [id=rtb-065eee68b235bf30b]%0Aaws_route_table_association.memo_board_2: Creating...%0Aaws_route_table_association.memo_board_1: Creating...%0Aaws_route_table_association.memo_board_3: Creating...%0Aaws_route_table_association.memo_board_3: Creation complete after 0s [id=rtbassoc-013da13c782db7bbf]%0Aaws_route_table_association.memo_board_2: Creation complete after 0s [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_1: Creation complete after 1s [id=rtbassoc-0c58c63df918ad4fc]%0A%0AApply complete! Resources: 9 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_internet_gateway.memo_board will be created%0A  + resource "aws_internet_gateway" "memo_board" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags_all = (known after apply)%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags_all         = (known after apply)%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.memo_board_1 will be created%0A  + resource "aws_route_table_association" "memo_board_1" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.memo_board_2 will be created%0A  + resource "aws_route_table_association" "memo_board_2" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.memo_board_3 will be created%0A  + resource "aws_route_table_association" "memo_board_3" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_subnet.memo_board_1 will be created%0A  + resource "aws_subnet" "memo_board_1" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.16.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.memo_board_2 will be created%0A  + resource "aws_subnet" "memo_board_2" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.16.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.memo_board_3 will be created%0A  + resource "aws_subnet" "memo_board_3" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.16.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.memo_board will be created%0A  + resource "aws_vpc" "memo_board" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "172.16.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = (known after apply)%0A      + enable_dns_support                   = true%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags_all                             = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0Aaws_vpc.memo_board: Creating...%0Aaws_vpc.memo_board: Creation complete after 3s [id=vpc-07dac755b05cdc5e5]%0Aaws_subnet.memo_board_1: Creating...%0Aaws_internet_gateway.memo_board: Creating...%0Aaws_subnet.memo_board_3: Creating...%0Aaws_subnet.memo_board_2: Creating...%0Aaws_subnet.memo_board_3: Creation complete after 1s [id=subnet-0f84ebfae4c920a30]%0Aaws_internet_gateway.memo_board: Creation complete after 1s [id=igw-0310af73c3aeaf62f]%0Aaws_route_table.public: Creating...%0Aaws_subnet.memo_board_2: Creation complete after 1s [id=subnet-0ae15c749b9813fb9]%0Aaws_subnet.memo_board_1: Creation complete after 1s [id=subnet-047a19359c4468354]%0Aaws_route_table.public: Creation complete after 2s [id=rtb-065eee68b235bf30b]%0Aaws_route_table_association.memo_board_2: Creating...%0Aaws_route_table_association.memo_board_1: Creating...%0Aaws_route_table_association.memo_board_3: Creating...%0Aaws_route_table_association.memo_board_3: Creation complete after 0s [id=rtbassoc-013da13c782db7bbf]%0Aaws_route_table_association.memo_board_2: Creation complete after 0s [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_1: Creation complete after 1s [id=rtbassoc-0c58c63df918ad4fc]%0A%0AApply complete! Resources: 9 added, 0 changed, 0 destroyed.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":18,"Program":"tfcmt","SHA1":"eb56d31aecfee6543b35a64311fc8aaa5848d525","Vars":{},"WorkflowName":"Terraform"} -->